Revit 2024 API
UIApplication Class
 Represents an active session of the Autodesk Revit user interface, providing access to UI customization methods, events, the main window, and the active document.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class UIApplication : IDisposable
Visual Basic
Public Class UIApplication _
	Implements IDisposable
Visual C++
public ref class UIApplication : IDisposable
Remarks
 You can access documents from the database level Application object, obtained from the Application property. If you have an instance of the database level Application object, you can construct a UIApplication instance from it.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIApplication
 Autodesk.Revit.UI.Macros.ApplicationEntryPoint
See Also
UIApplication Members
Autodesk.Revit.UI Namespace